import { useNavigate } from 'react-router-dom';
import { useSelector } from 'react-redux';
import { CheckAuth } from '../../hooks/check-auth';

import { Box, Button, ButtonGroup, Typography } from '@mui/material';

import { RootState } from '../../store';

function Welcome() {
  const navigate = useNavigate();
  const { isAuth } = CheckAuth();
  const name = useSelector((state: RootState) => state.user.name);

  return (
    <div>
      <Box
        component="section"
        sx={{
          display: 'flex',
          flexDirection: 'column',
          justifyContent: 'center',
          alignItems: 'center',
          minHeight: 'calc(100vh - 50px)',
        }}
      >
        <Typography variant="h2" component="h1">
          Welcome{isAuth && `, ${name}`}
        </Typography>
        {isAuth ? (
          <Button variant="outlined" onClick={() => navigate('/')}>
            Go to Editor
          </Button>
        ) : (
          <ButtonGroup variant="outlined" size="large">
            <Button onClick={() => navigate('/sign-in')}>Sing In</Button>
            <Button onClick={() => navigate('/sign-up')}>Sing Up</Button>
          </ButtonGroup>
        )}
      </Box>
      <Box>
        <Typography>
          Что такое Lorem Ipsum? Lorem Ipsum - это текст-`рыба``, часто используемый в печати и
          вэб-дизайне. Lorem Ipsum является стандартной `рыбой`` для текстов на латинице с начала
          XVI века. В то время некий безымянный печатник создал большую коллекцию размеров и форм
          шрифтов, используя Lorem Ipsum для распечатки образцов. Lorem Ipsum не только успешно
          пережил без заметных изменений пять веков, но и перешагнул в электронный дизайн. Его
          популяризации в новое время послужили публикация листов Letraset с образцами Lorem Ipsum в
          60-х годах и, в более недавнее время, программы электронной вёрстки типа Aldus PageMaker,
          в шаблонах которых используется Lorem Ipsum. Почему он используется? Давно выяснено, что
          при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum
          используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а
          также реальное распределение букв и пробелов в абзацах, которое не получается при простой
          дубликации `Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст..`` Многие программы
          электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по
          умолчанию, так что поиск по ключевым словам `lorem ipsum`` сразу показывает, как много
          веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem
          Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно
          (например, юмористические варианты).
        </Typography>
        <Typography>
          Что такое Lorem Ipsum? Lorem Ipsum - это текст-`рыба``, часто используемый в печати и
          вэб-дизайне. Lorem Ipsum является стандартной `рыбой`` для текстов на латинице с начала
          XVI века. В то время некий безымянный печатник создал большую коллекцию размеров и форм
          шрифтов, используя Lorem Ipsum для распечатки образцов. Lorem Ipsum не только успешно
          пережил без заметных изменений пять веков, но и перешагнул в электронный дизайн. Его
          популяризации в новое время послужили публикация листов Letraset с образцами Lorem Ipsum в
          60-х годах и, в более недавнее время, программы электронной вёрстки типа Aldus PageMaker,
          в шаблонах которых используется Lorem Ipsum. Почему он используется? Давно выяснено, что
          при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum
          используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а
          также реальное распределение букв и пробелов в абзацах, которое не получается при простой
          дубликации `Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст..`` Многие программы
          электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по
          умолчанию, так что поиск по ключевым словам `lorem ipsum`` сразу показывает, как много
          веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem
          Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно
          (например, юмористические варианты).
        </Typography>
        <Typography>
          Что такое Lorem Ipsum? Lorem Ipsum - это текст-`рыба``, часто используемый в печати и
          вэб-дизайне. Lorem Ipsum является стандартной `рыбой`` для текстов на латинице с начала
          XVI века. В то время некий безымянный печатник создал большую коллекцию размеров и форм
          шрифтов, используя Lorem Ipsum для распечатки образцов. Lorem Ipsum не только успешно
          пережил без заметных изменений пять веков, но и перешагнул в электронный дизайн. Его
          популяризации в новое время послужили публикация листов Letraset с образцами Lorem Ipsum в
          60-х годах и, в более недавнее время, программы электронной вёрстки типа Aldus PageMaker,
          в шаблонах которых используется Lorem Ipsum. Почему он используется? Давно выяснено, что
          при оценке дизайна и композиции читаемый текст мешает сосредоточиться. Lorem Ipsum
          используют потому, что тот обеспечивает более или менее стандартное заполнение шаблона, а
          также реальное распределение букв и пробелов в абзацах, которое не получается при простой
          дубликации `Здесь ваш текст.. Здесь ваш текст.. Здесь ваш текст..`` Многие программы
          электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по
          умолчанию, так что поиск по ключевым словам `lorem ipsum`` сразу показывает, как много
          веб-страниц всё ещё дожидаются своего настоящего рождения. За прошедшие годы текст Lorem
          Ipsum получил много версий. Некоторые версии появились по ошибке, некоторые - намеренно
          (например, юмористические варианты).
        </Typography>
      </Box>
    </div>
  );
}

export default Welcome;
